Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: analyse the security behaviour of states and their strategies and use of instruments, emphasising Norwegian strategies and the possibilities and limitations of military power.
nb: analysere staters sikkerhetsatferd og deres strategier og virkemiddelbruk, med vekt på norske strategier og militærmaktens muligheter og begrensninger.

source: The subject provides insight into the implementation and management of deployment and detachment in international operations.
nb: Temaet gir en innsikt i gjennomføring og ledelse av deployering og detasjement til internasjonale operasjoner.

source: • describe calculation and analysis methods for electrical circuits within the course area
nb: • beskrive beregnings- og analysemetoder for elektriske kretser innen emneområdet

source: Furthermore, emphasis is placed on further developing the basic leadership and methods for leadership development with emphasis on communication, learning from practice, feedback, as well as professional and personal reflection.
nb: Videre vektlegges det å videreutvikle det grunnleggende lederskapet og metoder for lederutvikling med vekt på kommunikasjon, lære av praksis, tilbakemeldinger, samt faglig og personlig refleksjon.

source: analyze own observations about English language and communication in own industry, and formulate it in a coherent academic text
nb: analysere egne observasjoner omkring engelsk språk og kommunikasjon i egen bransje, og formulere det i en koherent akademisk tekst

source: to develop the mental and physical hardiness of the cadets.
nb: utvikle kadettenes mentale og fysiske robusthet («hardiness»).

source: Intact and damaged stability, surface vessels:
nb: Intakt og skade stabilitet, overflatefartøyer:

source: These historical examples will help to demonstrate the role of the officer during war and extreme situations (officer identity), and with a focus on the “Chief of Defence’s view of leadership within the Norwegian Armed Forces", the implications that the theories and doctrines have for the officer and what characteristics are required will be discussed.
nb: Disse historiske eksempler vil bidra til å synliggjøre offiserens rolle i krig og ekstreme situasjoner (offisersidentitet), og med utgangspunkt i «Forsvarssjefens grunnsyn på ledelse i Forsvaret» vil det diskuteres hvilke implikasjoner teori og doktriner har for offiseren og hvilke egenskaper som kreves.

source: under guidance, perform key officer duties in crisis and war in their industry.
nb: under veiledning, utføre sentrale offisersoppgaver i krise og krig i sin bransje.

source: The purpose of the subject is to provide insight into which processes become central when planning, directing and deploying a detachment to an international operation.
nb: Hensikten med temaet er å gi innsikt om hvilke prosesser som blir sentrale når man skal planlegge, lede og deployere med et detasjement til en internasjonal operasjon.

source: Joining methods, welding and bolted joints.
nb: Sammenføyningsmetoder, sveise og skrueforbindelser.

source: Systems for control and regulation of air/fuel supply and performance of gas turbines.
nb: Systemer for kontroll og regulering av luft/brennstofftilførsel og ytelse til gassturbiner.

source: discuss the main difference between Clausewitz’s and Jomini’s theories on war
nb: forklare hovedforskjellen på Clausewitz’ og Jominis teorier om krig

source: Student presentations, compulsory submissions, supervision and self-studies.
nb: · Elevframføringer, obligatoriske innleveringer, veiledning og selvstudium.

source: Explain design principles for defensible II
nb: Forklare designprinsipper for forsvarbar INI

source: Sequential circuits, synchronous and asynchronous.
nb: Sekvensielle kretser, synkrone og asynkrone.

source: Be able to discuss research questions, analyses and findings within their field of study, with other specialists as well as with the general public
nb: kommunisere om faglige problemstillinger, analyser og konklusjoner innenfor fagområdet, både med spesialister og til allmennheten

source: Steel and cast iron, production.
nb: Stål og støpejern, fremstilling.

source: - Understand the UN from a security policy perspective, with special emphasis on UN peace operations;
nb: - Forstå FN i et sikkerhetspolitisk perspektiv, med spesiell vekt på FNs fredsoperasjoner;

source: This is coordinated with the Naval Warfare Centre (MKS).
nb: Dette koordineres med Marinens krigføringssenter(MKS).

source: provide examples of materials used in marine and machine constructions, advantages, disadvantages and their corrosive properties.
nb: gi eksempler på materialer som nyttes i marine- og maskinkonstruksjoner, fordeler, ulemper og deres korrosive egenskaper.

source: This is achieved through a focus on the individual and collective ability to make decisions (professional expertise) and the ability to provide support and interaction (relationship skills), including creating good decision-making processes within teams and groups.
nb: Dette med fokus på individuell og kollektiv evne til å ta beslutninger (fagkompetanse) og evne til å skape oppslutning og samhandling (relasjonskompetanse), herudner skape gode beslutningsprosesser i lag og grupper.

source: Explain defence, environmental, health, social and financial consequences of products and solutions in the machinery discipline in the Navy and place these in an ethical perspective and a life cycle perspective.
nb: forklare forsvarsmessige, miljømessige, helsemessige, og økonomiske konsekvenser av produkter og løsninger innenfor elektro- og automasjonsfaget i Sjøforsvaret og kan sette disse i et etisk perspektiv og et livsløpsperspektiv.

source: Tables, figures, drawings, attachments and reference lists come in addition.
nb: Tabeller, figurer, tegninger, vedlegg og referanselister kommer i tillegg.

source: Bachelor’s Degree in Military Studies with Specialisation in Management - Naval Power and Military Navigation
nb: Bachelor i militære studier med fordypning i ledelse - Sjømakt og militær navigasjon

source: This is arrived at by focusing on how the impact of the operational environment (local political, military, economic, social, legal and cultural conditions) can affect ground warfare.
nb: Dette gjøres ved å sette fokus på hvordan operasjonsmiljøets innvirkning (lokale politiske, militære, økonomiske, sosiale, juridiske og kulturelle forhold) kan påvirke militære landoperasjoner.

source: Women, peace and security, protection of civilians, and the role of military force
nb: Kvinner fred og sikkerhet, beskyttelse av sivile og militærmaktens rolle.

source: Total 609 pages
nb: Totalt 609 sider

source: utilise idiomatic structures in English both in writing and orally, is able to recognise and transfer relevant learning between different contexts.
nb: Benytte idiomatiske strukturer på engelsk både skriftlig og muntlig, og kan gjenkjenne og overføre relevant læring mellom ulike kontekster.

source: explain how the powers of the various branches of the Norwegian Armed Forces contribute to a joint operation.
nb: forklare hvordan forsvarsgrensvise styrker bidrar i en fellesoperasjon.

source: Life cycle considerations, shipbuilding methods, workflow on construction site from contract to delivery.
nb: Livsløpsbetraktninger., Skipsbyggingsmetoder, arbeidsgang på byggeverksted fra kontraktinngåelse til levering.

source: • explain the digital engineering foundation for information and communication technology.
nb: • forklare det digitalteknologiske grunnlaget for informasjons- og kommunikasjonsteknologi

source: skill in establishing procedures for safe handling of cargo in accordance with relevant documents such as IMDG, IMSBC code, BLU code and Grain code
nb: ferdighet i å etablere prosedyrer for sikker håndtering av last i samsvar med relevante dokumenter som IMDG, IMSBC code, BLU code og Grain code

source: knowledge of sailing routes in accordance with General Provisions on Ships' Routeing
nb: kjennskap til seilingsruter i samsvar med General Provisions on Ships’ Routing

source: Meteorology and Oceanography for Seafarers
nb: Meteorologi og oseanografi for sjøfolk

source: Explain how the simulator can be used as a educational platform.
nb: Forklare hvordan simulator kan benyttes som en plattform for læring.

source: · Student presentations, compulsory assignments, tutorials and independent study.
nb: · Elevframføringer, obligatoriske innleveringer, veiledning og selvstudium.

source: employ relevant theories and methods when posing research questions, answering them and organising inquiries relevant to their profession
nb: anvende relevante teorier og metoder for å stille nye, yrkesrelaterte spørsmål, besvare dem, og utføre analyser på en selvstendig måte

source: Switches, protection and selectivity.
nb: Brytere, vern og selektivitet.

source: discuss language and communication issues in their own industry in the light of relevant academic literature
nb: drøfte språk- og kommunikasjonsproblematikk i egen bransje i lys av relevant akademisk litteratur

source: Week 1: The big picture
nb: Uke 1: Det store bildet

source: apply and account for the methods in network calculations and network analyses
nb: anvende og gjøre rede for metodene i nettverksberegninger og nettverksanalyser

source: summarise safe management and operation of marine turbo engines in simulator and in laboratory.
nb: gjengi sikker operering og drift av marine turbomaskiner på simulator og i laboratoriet.

source: Given the changing context of armed conflicts after the end of the Cold War, how is this reflected in the UN mandate, policy and principles?
nb: Gitt endringer i væpnende konflikter etter den kalde krigen, hvordan reflekteres det i FNs mandat, policy og prinsipper?

source: Navigation for Maritime Studies,
nb: Navigasjon for maritime studier,

source: It is mandatory with supervision on the master's thesis.
nb: Nærmere frister og tidsplan blir gitt av studieadministrasjonen.

source: Apply theoretical and practical skills for maintenance and increase of own and unit’s operative performance.
nb: Anvende teoretiske og praktiske ferdigheter for vedlikehold og økning av egen og avdelingens operative yteevne.

source: Classroom, NavSim demo, independent-study package
nb: Klasserom, demo i navsim, Selvstudiepakke

source: lead himself/herself and groups in stress-related situations, including solving the mission and safeguarding the personnel.
nb: lede seg selv og grupper i stressrelaterte situasjoner, herunder løse oppdraget og ivareta personellet.

source: • calculate and describe electrical/magnetic properties of resistors, capacitors and coils
nb: • beregne og beskrive elektriske/magnetiske egenskaper til motstander, kondensatorer og spoler

source: lead himself/herself and teams in different situations.
nb: lede seg selv og team i ulike situasjoner.

source: The training shall enable the officer to command and lead a division at troop level in peace, crisis and war.
nb: Utdanningen skal sette offiseren i stand til å ha kommando over og føre en avdeling på troppsnivå i fred, krise og krig.

source: to provide the cadets with an introduction to operational planning and decision-making processes.
nb: gi kadettene en introduksjon til operative plan- og beslutningsprosesser.

source: We try to understand the UN in an international security policy perspective, and take a closer look at the dominant theories for how states interact on security issues.
nb: Vi forsøker å forstå FN i et internasjonalt sikkerhetspolitisk perspektiv, og ser nærmere på de dominerende teoriene for hvordan stater samhandler i sikkerhetsspørsmål.

source: The course is based on the ING1501 The cyber engineer’s profession, ING1506 Data communication, ING2506 Telecommunications, ING2503 Information security, ING1503 Programming and digital technology ING1507 Computer architecture, ING2504 Operating systems, INGTS401 Telecommunications and ING3508 Military Information Infrasturcture
nb: Emnet bygger på ING1501 Cyberingeniørens profesjon, ING1506 Datakommunikasjon, ING2506 Telekommunikasjon, ING2503 Informasjonssikkerhet, ING1503 Programmering og digitalteknikk ING1507 Datamaskinarkitektur, ING2504 Operativsystemer, INGTS401 Telekommunikasjon og ING3508 Militær informasjonsinfrastruktur

source: skill in applying relevant international rules, codes and norms regarding safe loading, unloading, stowage, securing and transport of cargo
nb: ferdighet i å anvende relevante internasjonale regler, koder og normer vedrørende trygg lasting, lossing, stuing, sikring og transport av last

source: The cadet gains knowledge of the Navy's terminology, goals, strategies and systems for Navy vessel maintenance.
nb: Kadetten har kjennskap til Sjøforsvarets terminologi, målsetning, strategi og systemer for vedlikehold av Sjøforsvarets fartøyer.

source: The formal officer development in the BA in Military Studies, Leadership and Land Power concludes with this course, and cadets are prepared for their ongoing development as officers even after their education.
nb: Den formelle offisersutviklingen i BA i militære studier, ledelse og landmakt avsluttes med dette emnet, og kadettene skal settes i stand til å fortsette sin offisersutvikling også etter utdannelsen.

source: Since 1949, NATO has been the most important arena for transatlantic defence and security policy cooperation for Norway.
nb: Siden 1949 har NATO vært den viktigste arenaen for transatlantisk forsvars- og sikkerhetspolitisk samarbeid for Norge.

source: Evaluate your own practice in the light of relevant theory, knowledge and research.
nb: Vurdere egen praksis i lys av relevant teori, kunnskap, forskning og erfaring.

source: Manual for Kongsberg Neptun load calculator,
nb: Manual for Kongsberg Neptun lastehåndteringssimulator,

source: Academic methodology, theory of knowledge and decision-making theory provide a basis for critical thinking, and an understanding of the premises and the frameworks for the staff study and the planning and decision-making process.
nb: Vitenskapelig metode, kunnskapsteori og beslutningsteori gir et grunnlag for kritisk tenkning og en forståelse for premissene og rammene for stabsstudien og plan- og beslutningsprosessen.

source: Explain how legal, ethical, cultural and historical issues influence the use of military power in a given operational environment.
nb: forklare hvordan rettslige, etiske, kulturelle, og historiske forhold påvirker militær oppdragsløsning i et gitt operasjonsmiljø.

source: update his knowledge within the field, both through information gathering and contact with relevant departments in the Armed Forces, professional environments and practice.
nb: oppdatere sin kunnskap innenfor fagfeltet, både gjennom informasjonsinnhenting og kontakt med relevante avdelinger i Forsvaret, fagmiljøer og praksis.

source: Time-discrete system theory with z-transformation, differential equations and frequency response analysis.
nb: Tidsdiskret systemteori med z-transformasjon, differensligninger og frekvensresponsanalyse.

source: explain the significance of communication and cultural understanding in military operations, and use English as command language with emphasis on naval terminology/maritime English
nb: forklare betydningen av kommunikasjon og kulturforståelse i militære operasjoner, samt bruke engelsk som kommandospråk med vekt på sjømilitær terminologi / maritim engelsk.

source: demonstrate critical understanding of different perspectives on (and use of) air power.
nb: vise kritisk forståelse for ulike perspektiver på (og bruk av) luftmakt

source: Testing of materials, non.destructive and destructive.
nb: Materialprøver, ikke- destruktive og destruktive.

source: Also covered in Subject 3: Deployment in an international operation provides a stronger formal basis (planning process) with which to meet the students of the other military academies on the
nb: Samtidig skal tema 3: Deployering til en internasjonal operasjon gi styrket faglig grunnlag (planprosess) til å møte elevene fra de andre krigsskolene i emnet

source: Course topic selection is coordinated with Weapons/Sensors instruction, Navigation Systems and Communication K2IS.
nb: Emnevalget koordineres med Våpen/sensor-lære, Navigasjonssystemer og Samband K2IS.

source: Explain how ethical and legal (jus ad bellum) justifications for the use of military power affect mandates and rules of engagement.
nb: forklare hvordan rettslige og etiske begrunnelser for militær maktbruk (jus ad bellum) påvirker mandat og engasjementsregler.

source: Cover page, table of contents, literature list, possibly footnotes, tables, illustrations and any attachments are also included and are not included in the scope limit.
nb: Forside, innholdsfortegnelse, litteraturliste, evt fotnoter, tabeller, illustrasjoner og eventuelle vedlegg kommer i tillegg og regnes ikke med i omfangsbegrensningen.

source: select equipment, for HMI as well, and prepare images and controls for automation and monitoring.
nb: velge utstyr og for HMI og utarbeide bilder og betjening for automatisering og overvåkning.

source: analyse joint operational planning and implementation processes within NATO
nb: analysere fellesoperative planleggings- og gjennomføringsprosesser i NATO

source: After the Field Training Exercise, time is set aside for follow-up work and summarising; follow-up work related to the Co-operation Course may have to be integrated into the course.
nb: Etter føringsøvelsen settes det av tid dager til etterarbeid og oppsummering, evnt etterarbeid relatert til samvirkekurset må planlegges inn i kurset.

source: Military or relevant civil education that, in relation to § 3-4 of the Regulation on Universities and University Colleges, is approved as equivalent to the aforementioned degrees or qualifications.
nb: Militær eller relevant sivil utdanning som i henhold til § 3-4 i lov om universiteter og høyskoler er godkjent som jevngod med ovennevnte grader eller utdanningsløp.

source: Polymers and composites Corrosion, wear.
nb: Polymerer og kompositter Korrosjon, slitasje.

source: The education provides an in-depth introduction to the possibilities, limitations and practical use of the NASAMS air defense system.
nb: Utdanningen gir en inngående innføring i muligheter, begrensninger og praktisk bruk av luftvernsystemet NASAMS.

source: The Navy’s/ FLO/ FMA maintenance concepts, objective, strategy, organisation and applied methods
nb: Sjøforsvarets/ FLO/ FMA vedlikeholdskonsepter, målsetning, strategi, organisering og anvendte metoder

source: The students carry out two case studies (South Sudan and Congo) that illustrate variations in peacekeeping.
nb: Studentene gjennomfører to case-studier (Sør Sudan og Kongo) som belyser variasjoner innen fredsbevaring.

source: Justification and assessment of the semester assignment and adjusting oral, as well as the overall grade are given within one week after the adjusting oral exam has been completed.
nb: Begrunnelse og vurdering av semesteroppgave og justerende muntlig, samt samlet karakter gis innen en uke etter justerende muntlig prøve er gjennomført.

source: explain the basic principles for the representation of geographical data and cartographic communication
nb: forklare grunnprinsippene for representasjon av geografiske data og kartografisk kommunikasjon

source: Excerpts from speaches, including Obama, Barack “Address to the Nation, September 10, 2013”, George W. Bush.
nb: Utvalg av engelskspråklige taler, inkludert Obama, Barack “Address to the Nation, September 10, 2013”, George W. Bush.

source: apply technical knowledge to practical and theoretical issues and make informed choices within operation and maintenance.
nb: anvende faglig kunnskap på praktiske og teoretiske problemstillinger og treffe begrunnede valg innen drift og vedlikehold.

source: Loading, handling and unloading of bulk cargo – BLU code and IGC code
nb: Lasting, behandling og lossing av bulklaster – BLU koden og IGC koden

source: critically assess the relevance and effects of the Norwegian Armed Forces’ managerial and leadership concepts and approaches.
nb: kritisk vurdere relevansen og virkninger av Forsvarets styrings- og ledelseskonsepter og tilnærminger.

source: In the framework of Human Security / Protection of Civilians, dilemmas are discussed regarding role and threat understanding, use of force and civil-military cooperation.
nb: I rammen av Human Security/Protection of Civilians drøftes dilemmaer ved rolle- og trusselforståelse, bruk av makt og sivilmilitært samarbeid.

source: Explain the role of tactical co-operations in joint operations.
nb: Forklare taktisk samvirke som en del av fellesoperasjoner.

source: reflect on and discuss the possibilities and limitations of military force in light of theoretical knowledge, legal and ethical assessments, historical experiences and the context of security policy.
nb: reflektere over og diskutere militærmaktens muligheter og begrensninger i lys av teoretisk kunnskap, rettslige og etiske vurderinger, historiske erfaringer og den sikkerhetspolitiske kontekst.

source: The one-week Automatic Radar Plotting Aid (ARPA) and AIS courses in the simulator in semester 4 come just before Easter.
nb: Automatic Radar Plotting Aid (ARPA) og AIS kurs på en uke i simulatoren i semester 4 kommer like før påske.

source: Posters for the bachelor's thesis are submitted after the date and time for the submission of the bachelor's thesis.
nb: Innleveringen av poster om bacheloroppgaven er etter tidspunktet for innleveringen av bacheloroppgaven.

source: Load determination of two-dimensional cases for static and dynamic conditions.
nb: Lastbestemmelse av to-dimensjonale tilfeller for statiske og dynamiske forhold.

source: The course is coordinated with workshop practical training/periodic voyages and the courses Marine Propulsion Machinery, Marine Turbomachinery, Machine elements and Materials science as well as Marine Machinery Systems and Survivability.
nb: Emnet koordineres med verkstedopplæringen/seilasperioder og emnene Marint framdriftsmaskineri, Marine turbomaskiner, Maskinkonstruksjon og materilallære samt Maritime maskinerisystemer og overlevelsesevne.

source: use a relevant formula system and terminology
nb: benytte et relevant begreps- og formelapparat

source: The evaluation of the course will take place in accordance with guidelines for FHS.
nb: Evalueringen av emne vil foregå i henhold til retningslinjer for FHS.

source: Conduct search in different sources as libraries, archives, and internet
nb: gjennomføre kildesøk i bibliotek, arkiv og på nettbaserte tjenester.

source: The PCC and CLM Courses provide knowledge and direct experience of the tasks and demands placed on military leadership and co-operation.
nb: Samvirkekurset og stridskurset tilfører kunnskap om, og erfaringer med, de oppgaver og krav som stilles til militært lederskap og samvirke.

source: Parallel connections, generator and motor operation.
nb: Parallell kobling, Generator- og motordrift.

source: General organisational theory and alterations in organisational/change management
nb: Organisasjonsforståelse, organisasjonslæring og endringsledelse i Luftforsvaret

source: The Norwegian Pilot: volume 1, chapter II
nb: Den norske los: bind 1 kapittel II

source: • explain various techniques for signal modulation/demodulation, coding/decoding, and system structure that is used in telecommunication networks
nb: • forklare forskjellige teknikker for signalmodulering /-demodulering, koding/dekoding, og systemoppbygging som brukes i telekommunikasjonsnett
